org-content/ecology.org
#+hugo_base_dir: ../
#+hugo_section: ecology
* Chapter 2
:PROPERTIES:
:EXPORT_HUGO_SECTION*: ch-2
:EXPORT_FILE_NAME: _index
:END:
** review
1. mutation
2. allele
3. gene frequencies
4. genotype
5. phenotype
** Important terms for the course
+ =Evolution= is the change of populations (species) over time due to heritable changes.
+ =Natural Selection= is the "selection" of heritable traits due to their fitness
+ =Adaptation= is the tendency for natural selection to select changes most well suited to the environment.
+ =Fitness= is the likelihood that an organism will survive (pass its genes down) in its current environment.
** Mechanisms for evolutionary change
+ Natural Selection
+ Genetic drift
+ Gene Flow
+ Mutation pressure
** Natural section, genetic drift, gene flow
*** genetic drift
The random change of allele frequency based on non-random mating. Only affects populations with limited populations (non-random mating)
*** Gene flow
Individuals can move from population to population, or form a new population.
These fluctuations can change the allele frequencies in a population.
**** Isolation
Differentiation is affected by Isolation. Isolation prevents gene flow.
*** Hardy Weinberg
+ \(P^2 + 2PQ + Q^2\)
** Adaptation is an undirected process
Traits are not created to adapt to the environment. Traits instead are randomly generated (through mutation) and the traits that are well suited to the environment are selected for.
** Phenotypic Plasticity
Development of physiological variation among phenotypes induced directly by the environment.
+ Occurs during the development of an individual.
+ Himalayan Rabbits are a good example, they have areas of black fur if born in a cold environment.
** Adaptive landscape
An adaptive landscape is a three dimensional plot, where the x and y axis refer to allele frequency and the z axis refers to fitness. "Peaks" and "Valleys" show how different allele frequencies affect fitness and why genetic drift can be helpful for adaptation.
** Red Queen Hypothesis
Increased fitness in the short term does not always end well for the species.
This discrepancy of fitness between two related organisms (parasites/hosts, predators/prey) is related to generational rate. One of the species in the relationship cannot keep up evolutionarily with its pair species. This may result in extinction of prey or predator or both.
